Using colleg.csv for the following questions:

### Exercise 5. Find the mean and standard deviation of math and verbal SAT score for men-only, women-only, and non gender specific universities.

### Exercise 6. Find the top 3 universities with largest numbers of undergraduate students for each state

In [2]:
import pandas as pd

In [5]:
df1 = pd.read_csv('college.csv')

In [27]:
df1.head()

,instnm,city,stabbr,hbcu,menonly,womenonly,relaffil,satvrmid,satmtmid,distanceonly,...,ugds_2mor,ugds_nra,ugds_unkn,pptug_ef,curroper,pctpell,pctfloan,ug25abv,md_earn_wne_p10,grad_debt_mdn_supp
0,Alabama A & M University,Normal,AL,1.0,0.0,0.0,0,424.0,420.0,0.0,...,0.0000,0.0059,0.0138,0.0656,1,0.7356,0.8284,0.1049,30300,33888
1,University of Alabama at Birmingham,Birmingham,AL,0.0,0.0,0.0,0,570.0,565.0,0.0,...,0.0368,0.0179,0.0100,0.2607,1,0.3460,0.5214,0.2422,39700,21941.5
2,Amridge University,Montgomery,AL,0.0,0.0,0.0,1,NaN,NaN,1.0,...,0.0000,0.0000,0.2715,0.4536,1,0.6801,0.7795,0.8540,40100,23370
3,University of Alabama in Huntsville,Huntsville,AL,0.0,0.0,0.0,0,595.0,590.0,0.0,...,0.0172,0.0332,0.0350,0.2146,1,0.3072,0.4596,0.2640,45500,24097
4,Alabama State University,Montgomery,AL,1.0,0.0,0.0,0,425.0,430.0,0.0,...,0.0098,0.0243,0.0137,0.0892,1,0.7347,0.7554,0.1270,26600,33118.5

In [9]:
df1.columns

Index(['instnm', 'city', 'stabbr', 'hbcu', 'menonly', 'womenonly', 'relaffil',
       'satvrmid', 'satmtmid', 'distanceonly', 'ugds', 'ugds_white',
       'ugds_black', 'ugds_hisp', 'ugds_asian', 'ugds_aian', 'ugds_nhpi',
       'ugds_2mor', 'ugds_nra', 'ugds_unkn', 'pptug_ef', 'curroper', 'pctpell',
       'pctfloan', 'ug25abv', 'md_earn_wne_p10', 'grad_debt_mdn_supp'],
      dtype='object')

### 1. Mean and Std of Math and verbal SAT for Men only Universities

In [33]:
a = df1[df1['menonly']==1.0]['satvrmid'].dropna().mean()

In [34]:
b=df1[df1['menonly']==1.0]['satvrmid'].dropna().std()

In [35]:
c=df1[df1['menonly']==1.0]['satmtmid'].dropna().mean()

In [36]:
d=df1[df1['menonly']==1.0]['satmtmid'].dropna().std()

In [38]:
print('Mean of verbal score for men only university: {}'.format(a))
print('Std of verbal score for men only university: {}'.format(b))
print('Mean of math score for men only university: {}'.format(c))
print('Std of math score for men only university: {}'.format(d))

Mean of verbal score for men only university: 558.0
Std of verbal score for men only university: 52.49761899362675
Mean of math score for men only university: 566.4
Std of math score for men only university: 56.88848741177779

### 2. Mean and Std of Math and verbal SAT for Women only Universities

In [39]:
e = df1[df1['womenonly']==1.0]['satvrmid'].dropna().mean()

In [40]:
f=df1[df1['womenonly']==1.0]['satvrmid'].dropna().std()

In [41]:
g=df1[df1['womenonly']==1.0]['satmtmid'].dropna().mean()

In [42]:
h=df1[df1['womenonly']==1.0]['satmtmid'].dropna().std()

In [44]:
print('Mean of verbal score for women only university: {}'.format(e))
print('Std of verbal score for women only university: {}'.format(f))
print('Mean of math score for women only university: {}'.format(g))
print('Std of math score for women only university: {}'.format(h))

Mean of verbal score for women only university: 548.4
Std of verbal score for women only university: 70.65703550720669
Mean of math score for women only university: 531.32
Std of math score for women only university: 71.7093206401139

### 3. Mean and Std of Math and verbal SAT for non gender specific universities

In [45]:
i = df1[(df1['womenonly']==0.0) & (df1['menonly']==0.0)]['satvrmid'].dropna().mean()

In [46]:
j=df1[(df1['womenonly']==0.0) & (df1['menonly']==0.0)]['satvrmid'].dropna().std()

In [47]:
k=df1[(df1['womenonly']==0.0) & (df1['menonly']==0.0)]['satmtmid'].dropna().mean()

In [48]:
l=df1[(df1['womenonly']==0.0) & (df1['menonly']==0.0)]['satmtmid'].dropna().std()

In [51]:
print('Mean of verbal score for non gender specific universities: {}'.format(i))
print('Std of verbal score for non gender specific universities: {}'.format(j))
print('Mean of math score for non gender specific universities: {}'.format(k))
print('Std of math score for non gender specific universities: {}'.format(l))

Mean of verbal score for non gender specific universities: 522.1134199134199
Std of verbal score for non gender specific universities: 68.49748026328294
Mean of math score for non gender specific universities: 530.6003430531732
Std of math score for non gender specific universities: 73.58176532758233

### The top 3 universities with largest numbers of undergraduate students for each state

In [58]:
def func1(s):
    s = s.sort_values(ascending=False)
    top3 = s.iloc[:3]
    return top3

In [59]:
df1.groupby('stabbr')['ugds'].apply(func1)

stabbr
AK      60      12865.0
        62       5536.0
        66       3256.0
AL      5       29851.0
        9       20514.0
                 ...
WV      4060    21945.0
        4033     8871.0
WY      4137     9910.0
        4131     3170.0
        4134     2768.0
Name: ugds, Length: 166, dtype: float64

### Exercise 7. Generate a DataFrame for the ratios of (number of employees of specific gender and race/total number of employees) for all race-gender combinations.Â¶

In [67]:
df2= pd.read_csv('employee.csv')
df2.head()

,title,dept,salary,race,gender,hire_date
0,POLICE OFFICER,Houston Police Department-HPD,45279.0,White,Male,2015-02-03
1,ENGINEER/OPERATOR,Houston Fire Department (HFD),63166.0,White,Male,1982-02-08
2,SENIOR POLICE OFFICER,Houston Police Department-HPD,66614.0,Black,Male,1984-11-26
3,ENGINEER,Public Works & Engineering-PWE,71680.0,Asian,Male,2012-03-26
4,CARPENTER,Houston Airport System (HAS),42390.0,White,Male,2013-11-04

In [75]:
a = df2.groupby(['race', 'gender']).count()
a.reset_index()

              race  gender  title  dept  salary  hire_date
0            Asian  Female     18    18      18         18
1            Asian    Male     70    70      69         70
2            Black  Female    216   216     207        216
3            Black    Male    326   326     311        326
4         Hispanic  Female    101   101     100        101
5         Hispanic    Male    294   294     281        294
6  Native American  Female      4     4       3          4
7  Native American    Male      4     4       4          4
8            White  Female     78    78      72         78
9            White    Male    522   522     470        522

In [79]:
len(df2), a['title'].sum()

(1653, 1633)

length of df2 and a['title'].sum() are not the same, check out why:

In [77]:
df2.isnull().sum()

title          0
dept           0
salary       102
race          20
gender         0
hire_date      0
dtype: int64

We have 20 missing items in the race columns. This is the reason that the actual total number of employeee, which is 1653 caculated by len(df2), is different from 1633, which is calculated by a['title'].sum()

The question, however, is very likely asking for a dataframe to represent how race and gender combination affects the employment. So, using 1633 probably will better represent the result.

In [101]:
b = a/1633
c = b[['title']].rename(columns={'title': 'ratio'})
c.reset_index().round(2)

              race  gender  ratio
0            Asian  Female   0.01
1            Asian    Male   0.04
2            Black  Female   0.13
3            Black    Male   0.20
4         Hispanic  Female   0.06
5         Hispanic    Male   0.18
6  Native American  Female   0.00
7  Native American    Male   0.00
8            White  Female   0.05
9            White    Male   0.32

### Exercise 8. Use pd.melt() to unpivot table pv3 to the format of pv4 in exampel above.

In [122]:
pv2 = df2.pivot_table(index='gender', columns='race', 
                      values='salary', aggfunc='mean').round(-3)
pv3=pv2.reset_index()

In [123]:
pv3

race  gender    Asian    Black  Hispanic  Native American    White
0     Female  58000.0  48000.0   44000.0          59000.0  66000.0
1       Male  61000.0  52000.0   55000.0          69000.0  63000.0

In [147]:
pv4 = pd.melt(pv3, id_vars='gender').sort_values('gender').reset_index().drop('index', axis=1)
pv4

   gender             race    value
0  Female            Asian  58000.0
1  Female            Black  48000.0
2  Female         Hispanic  44000.0
3  Female  Native American  59000.0
4  Female            White  66000.0
5    Male            Asian  61000.0
6    Male            Black  52000.0
7    Male         Hispanic  55000.0
8    Male  Native American  69000.0
9    Male            White  63000.0